<a href='https://www.hexnbit.com/'> <img src='hexnbit.png'/> </a>

# Groupby
Groupby allows us to select columns and group the row data

In [1]:
import pandas as pd

In [2]:
sales_data={"Producer":["Maruti","Maruti","Tata","Tata","Honda","Honda"],
            "Sales Person":["Amit","Rahul","Sumit","Satish","Rohan","Abhinaw"],
            "Sale":[10,20,30,40,50,60]}
sales_data

{'Producer': ['Maruti', 'Maruti', 'Tata', 'Tata', 'Honda', 'Honda'],
 'Sales Person': ['Amit', 'Rahul', 'Sumit', 'Satish', 'Rohan', 'Abhinaw'],
 'Sale': [10, 20, 30, 40, 50, 60]}

In [3]:
# creating data frame from above defined dictionary
sales_frame=pd.DataFrame(sales_data)
sales_frame

  Producer Sales Person  Sale
0   Maruti         Amit    10
1   Maruti        Rahul    20
2     Tata        Sumit    30
3     Tata       Satish    40
4    Honda        Rohan    50
5    Honda      Abhinaw    60

In [4]:
# Grouping by Producer, each Producer has 2 sales persons
company_sales=sales_frame.groupby("Producer")

In [5]:
# printing total sale of each producer
# as sum is a mathematical function, columns containing strings will be ignored
(company_sales.sum())

          Sale
Producer
Honda      110
Maruti      30
Tata        70

In [6]:
# printing average sale
# as mean is a mathematical function, columns containing strings will be ignored
(company_sales.mean())

          Sale
Producer
Honda       55
Maruti      15
Tata        35

In [7]:
# Printing Maximum Sales for each producer
company_sales.max()

         Sales Person  Sale
Producer
Honda           Rohan    60
Maruti          Rahul    20
Tata            Sumit    40

In [8]:
# Printing Minimum Sales for each producer
company_sales.min()

         Sales Person  Sale
Producer
Honda         Abhinaw    50
Maruti           Amit    10
Tata           Satish    30

In [9]:
print(company_sales.describe())   # statistics

          Sale
         count  mean       std   min   25%   50%   75%   max
Producer
Honda      2.0  55.0  7.071068  50.0  52.5  55.0  57.5  60.0
Maruti     2.0  15.0  7.071068  10.0  12.5  15.0  17.5  20.0
Tata       2.0  35.0  7.071068  30.0  32.5  35.0  37.5  40.0

In [10]:
print(company_sales.describe().transpose()) # another format of statistics

Producer        Honda     Maruti       Tata
Sale count   2.000000   2.000000   2.000000
     mean   55.000000  15.000000  35.000000
     std     7.071068   7.071068   7.071068
     min    50.000000  10.000000  30.000000
     25%    52.500000  12.500000  32.500000
     50%    55.000000  15.000000  35.000000
     75%    57.500000  17.500000  37.500000
     max    60.000000  20.000000  40.000000

In [11]:
# Print stats for a specific producer
print(company_sales.describe().transpose()["Honda"])

Sale  count     2.000000
      mean     55.000000
      std       7.071068
      min      50.000000
      25%      52.500000
      50%      55.000000
      75%      57.500000
      max      60.000000
Name: Honda, dtype: float64